# 管理者初期データ
Admin.create!(
  [
    {
      email: 'a@a',
      password: '999999',
    }
  ]
)

# 初期タグ管理用ユーザー
Customer.create!(
  [
    {
      email: 'b@b',
      password: '999999',
      name: 'shimada'
    }
  ]
)

# タグ初期値
[
  [ 1, '山' ],
  [ 1, '海' ],
  [ 1, '川' ],
  [ 1, '滝' ],
  [ 1, '湖沼' ],
  [ 1, '湿原' ],
  [ 1, '高原' ],
  [ 1, '島' ],
  [ 1, '動物' ],
  [ 1, '植物' ],
  [ 1, '野鳥' ],
  [ 1, '景勝地' ],
  [ 1, '天文' ],
  [ 1, '気象現象' ],
  [ 1, '鉱山' ],
  [ 1, '天然資源' ],
  [ 1, '化石' ],
  [ 2, '庭園' ],
  [ 2, '史跡' ],
  [ 2, '城' ],
  [ 2, '古民家・集落' ],
  [ 3, 'ダム' ],
  [ 3, '架橋' ],
  [ 3, '塔' ],
  [ 4, '菓子' ],
  [ 4, 'レストラン' ],
  [ 5, '牧場' ],
  [ 5, '農園' ],
  [ 5, '果樹園' ],
  [ 6, 'テーマパーク' ],
  [ 6, '市場' ],
  [ 6, 'ショッピングモール' ],
  [ 7, '資料館' ],
  [ 7, '博物館' ],
  [ 7, '水族館' ],
  [ 7, '動物園' ],
  [ 7, '美術館' ],
  [ 8, '酒造' ],
  [ 8, '漆器' ],
  [ 8, '工場' ],
  [ 8, '研究所' ],
  [ 9, '温泉' ],
  [ 9, 'ホテル' ],
  [ 9, '旅館' ],
  [ 9, '民宿' ],
  [ 10, '1月' ],
  [ 10, '2月' ],
  [ 10, '3月' ],
  [ 10, '4月' ],
  [ 10, '5月' ],
  [ 10, '6月' ],
  [ 10, '7月' ],
  [ 10, '8月' ],
  [ 10, '9月' ],
  [ 10, '10月' ],
  [ 10, '11月' ],
  [ 10, '12月' ],
  [ 10, '春' ],
  [ 10, '夏' ],
  [ 10, '秋' ],
  [ 10, '冬' ],
  [ 11, 'ジオパーク' ],
  [ 11, '世界遺産' ],
  [ 11, '日本遺産' ],
  [ 11, '国立公園' ],
].each do |category, name|
  Tag.create(
    { customer_id: 1, tag_category: category, name: name, is_custom: false}
  )
end
